<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of NetBird from GitHub and imports it into a munki repo</string>
    <key>Identifier</key>
    <string>com.github.techahoy.munki.netbird</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NetBird</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>VPN</string>
            <key>description</key>
            <string>NetBird combines a configuration-free peer-to-peer private network and a centralized access control system in a single platform, making it easy to create secure private networks for your organization or home.</string> 
            <key>developer</key>
            <string>NetBird</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>13.0</string>
            <key>blocking_applications</key>
            <array>
                <string>NetBird</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true />
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>ParentRecipe</key>
    <string>com.github.techahoy.download.netbird</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>