<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release of NetBird from GitHub</string>
    <key>Identifier</key>
    <string>com.github.techahoy.download.netbird</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NetBird</string>
        <key>SEARCH_PATTERN</key>
        <string>netbird_\d+\.\d+\.\d+_darwin\.pkg</string>
        <key>GITHUB_REPO</key>
        <string>netbirdio/netbird</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>%SEARCH_PATTERN%</string>
                <key>github_repo</key>
                <string>%GITHUB_REPO%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>