<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release copy of GAMADV-XTD3 (Google Admin command line manager) from Github, creates a package, and imports it into a munki_repo. Available major macOS versions can be found at https://github.com/taers232c/GAMADV-XTD3/releases/latest.</string>
    <key>Identifier</key>
    <string>com.github.mikethehill.munki.gamadv-xtd3</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>G Suite</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>tools/GAMADV-XTD3</string>
        <key>NAME</key>
        <string>GAMADV_XTD3</string>
        <key>OS_MAJOR_VERSION</key>
        <string>14</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>GAMADV-XTD3 is a free, open source command line tool for Google G Suite Administrators to manage domain and user settings quickly and easily.</string>
            <key>developer</key>
            <string>Ross Scroggs</string>
            <key>display_name</key>
            <string>GAMADV-XTD3</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.mikethehill.pkg.gamadv-xtd3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>OS version collected as part of download recipe</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%min_os_vers%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
