<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest release copy of GAMADV-XTD3 (Google Admin command line manager) from Github</string>
    <key>Identifier</key>
    <string>com.github.mikethehill.download.gamadv-xtd3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GAMADV_XTD3</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
        	<key>Processor</key>
        	<string>GitHubReleasesInfoProvider</string>
        	<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>taers232c/GAMADV-XTD3</string>
				<key>asset_regex</key>
				<string>^.*macos-*-.*</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.tar</string>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
    </array>
</dict>
</plist>
